{
    "name": "Jason Zhang",
    "introduction": [{
        "whoAmI": "I am a QA Engineer Lead, with many experiences including software development, technical training and product release management. I'm constantly inspired working with diverse and knowledgeable individuals both within the organization and outside of it on a global scale with Partners. I bring to the table the visions of high quality software and processes advocating for user focused features, universally accessible design, and positive developer experiences.",
        "skills": [
            "QA Engineering",
            "Software Development",
            "Documentation and Enablement",
            "Web Application Testing",
            "Developer Management"
        ]
    }],
    "aboutMe": [
        {
        "skill": "Software QA Leadership",
        "hash": "#qa-leadership",
        "desc": "A veteran QA experienced with leading and owning the QA function in engineering or partner enablement programs from zero."
        },
        {
        "skill": "Automation Development",
        "hash": "#software-development",
        "desc": "Developed, extended and configured various developer tools and test frameworks (Integration, E2E, Performance) that contribute to software quality."
        },
        {
        "skill": "Continuous Integration & Deployment",
        "hash": "#devops",
        "desc": "An advocate of best development practices which including optimizing branching, orchestrating build, test & deploy infrastructure."
        },
        {
        "skill": "Web Application Testing",
        "hash": "#software-qa",
        "desc": "Extensive experience testing mobile and desktop applications in functionality, performance, accessibility, design and security. Can comfortably own test development, execution and consultancy of said applications."
        },
        {
        "skill": "Release Managemnet",
        "hash": "#progam-mangaement",
        "desc": "Experienced in cross departmental collaboration. Organizing all relevant stakeholders; PM’s, Engineers and QA involved to ensure proper communication, maximization of available resources and effective triage of risks to ensure smooth quality product releases. "
        },
        {
        "skill": "Software Development Methodologies",
        "hash": "#process",
        "desc": "Passionate with improving developer experience, engineering velocity and team engagement. This includes introducing principles, values and processes that maximize optimal practices."
        }
    ],    
    "education": [
        {
            "name": "Bachelor of Science, Software Systems @ Simon Fraser University",
            "date": "2011-2016",
            "img": "images/sfu.jpg",
            "desc": "In October of 2016, I graudated from Simon Fraser University earning Bachelor of Science in Software Systems by the Faculty of Applied Sciences, along with a Co-op Certificate of Completion for acquiring 16 months of industry experience."
        },
        {
            "name": "Highschool, International Baccalaureate Diploma @ Britannia Secondary School",
            "date": "2006-2011",
            "img": "images/britannia.jpg",
            "desc":"Enrolled in the IB Diploma Program, I was constantly challenged in highschool with post-secondary level subjects including higher level English, Biology and History. Was a consistent honour roll student as well extremely active in my community."
        }
    ],
    "timeline": [{
        "experience": "QA Engineer Lead, Product Release Manager @ Mobify",
        "date": "2016-2019",
        "img": "images/mobify.png",
        "alt": "mobify",
        "desc": "Contributed to the Mobify test framework and our Build and Test Infrastructure of Continuous Integration/Delivery, Performance Tests (Lighthouse, WebPageTest), End-to-End tests (Nightwatch, Selenium, Appium, Node.js) and general development tools (Bash, Node.js). Owned the company 6-week release cycle journey of planning, launch and retrospectives which included management of communications, collaboration, risk assessment, deployment and future iterations."
        },
        {
        "experience": "Production Services Technician @ Sony",
        "date": "2016",
        "img": "images/sony.jpg",
        "alt": "sony",
        "desc": "Underwent a large boot-camp program of development projects and in-house training enhancing my knowledge of python tools development, UNIX shell scripting and video effects pipeline. Collaboratively developed an Artist Reel Request Django web application that streamlined the process for the editors and artists to request their work from movies. This significantly reduced unnecessary overhead time as it consolidated the approval workflow, logging generation, data extraction, staging and shipping all into one tool."
        },        
        {
        "experience": "IT Technician @ SFU",
        "date": "2015",
        "img": "images/sfu.jpg",
        "alt": "sfu",
        "desc": "Provided technical services to students, faculty, staff and external clients for audio-visual and computing equipment across several faculty buildings solving various technical issues of software, hardware and website application issues to ensure client satisfaction and event success."
        },
        {
        "experience": "QA Automation Engineer @ Samsung",
        "date": "2016-2019",
        "img": "images/samsung.png",
        "alt": "samsung",
        "desc": "Worked closely with the SEAP and KNOX Portal team to develop project schedules, execute test plans, and automation in an Agile Scrum process which led to many high quality and successful releases under tight deadlines."
        },
        {
        "experience": "QA Analyst @ Gossammer Threads",
        "date": "2014",
        "img": "images/gossamer-threads.jpg",
        "alt": "gossamer-threads",
        "desc": "As one of the two only QA analysts of the company, I was responsible for undertaking many sites and large features sets independently, managing its QA processes before release to ensure client satisfaction and high product quality."
        }
    ]
}